IDEA Open Model
PrestressLoading Class
Compatible with IDEA StatiCa Beta 20.0
 Prestress loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.PrestressLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class PrestressLoading
Public Class PrestressLoading
The PrestressLoading type exposes the following members.
Constructors
Name | Description
PrestressLoading
Initializes a new instance of the PrestressLoading class
Top
Properties
Name | Description
PrimaryForces
 Primary internal force in section
SecondaryForces
 Secondary internal force in section
Time
 Time
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace